'isnull' or 'isna' can be used to remove blanks in a dataset, that is 'nan'

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    'Col A': [1, np.nan, 7],
    'Col B': [np.nan, 2, 3],
    'Col C': [np.nan, 2, np.nan]
})
df

   Col A  Col B  Col C
0    1.0    NaN    NaN
1    NaN    2.0    2.0
2    7.0    3.0    NaN

In [5]:
pd.isnull(df)

   Col A  Col B  Col C
0  False   True   True
1   True  False  False
2  False  False   True

In [8]:
pd.notnull(df).sum()

Col A    2
Col B    2
Col C    1
dtype: int64

to get the values od not null
for example (df[pd.notnull(df)])

In [12]:
df[pd.notnull(df)]

   Col A  Col B  Col C
0    1.0    NaN    NaN
1    NaN    2.0    2.0
2    7.0    3.0    NaN

In [ ]:
df.isnull() # shorter way

   Col A  Col B  Col C
0  False   True   True
1   True  False  False
2  False  False   True

In [15]:
df.dropna()

Empty DataFrame
Columns: [Col A, Col B, Col C]
Index: []

In [16]:
df[df.notnull()]

   Col A  Col B  Col C
0    1.0    NaN    NaN
1    NaN    2.0    2.0
2    7.0    3.0    NaN

In [17]:
df.dropna()

Empty DataFrame
Columns: [Col A, Col B, Col C]
Index: []

for dropna in a dataframe, it drops all the rows that has the na values, while for series, it just drop the one that has na

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col A   2 non-null      float64
 1   Col B   2 non-null      float64
 2   Col C   1 non-null      float64
dtypes: float64(3)
memory usage: 200.0 bytes

In [20]:
df.dropna(axis = 1)  # to drop a column that has null values

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [21]:
df

   Col A  Col B  Col C
0    1.0    NaN    NaN
1    NaN    2.0    2.0
2    7.0    3.0    NaN

In [23]:
df.fillna({'Col A':5, 'Col B': 0, 'Col C':6})

   Col A  Col B  Col C
0    1.0    0.0    6.0
1    5.0    2.0    2.0
2    7.0    3.0    6.0